app/Http/Controllers/BlogController.php

select * from `posts` where `slug` = 'null' and `posts`.`deleted_at` is null limit 1
---
    public function showPost(Request $request, $slug)
    {
        $user = \Auth::user();

        // Allow writers to view posts in draft mode and future dates
        if ($user && $user->level() > 2) {
            $post = Post::with('tags')
                            ->bySlug($slug)
                            ->firstOrFail();

select * from `dashboarddata` where `dashboarddata`.`deleted_at` is null
---
    public function authors(Request $request)
    {
        $dashboarddata = Dashboarddata::all();