app/Http/Controllers/Admin/DashboarddataController.php

update `dashboarddata` set `Corporate_Security_Division` = '10', `EBUD` = '14', `Finance_Division` = '30', `Financial_Services_Division` = '90', `Resource_Division` = '87', `Technology_Division` = '40', `VGE_Division` = '10', `dashboarddata`.`updated_at` = '2021-02-23 07:54:33' where `id` = 1
---
        $dashboarddata->Technology_Division =  $request->fied10;
        $dashboarddata->VGE_Division =  $request->fied11;

        $dashboarddata->save();